Revit 2027 API
Profile.Filled Property
Get or set whether the profile is filled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Filled { get; set; }
Public Property Filled As Boolean
	Get
	Set
public:
property bool Filled {
	bool get ();
	void set (bool value);
}
member Filled : bool with get, set
Property Value
Boolean
See Also
Reference
Profile Class
Autodesk.Revit.DB Namespace